{
  "title": "Facebook Timeline Service",
  "url": "https://interviewing.io/mocks/facebook-timeline-service",
  "summary": "Overall: \nTC did almost everything(requirement gathering, API design, estimations, High level design, trade-off analysis) perfectly.\n\nStrengths:\n+ TC gathered the functional requirements well:\n     - TC clarified if they need to provide functionality of making the friends.\n     - TC clarified if they need to provide functionality of looking at specific user's posts.\n     - TC clarified that they would design for the. different surfaces/devices.\n+ TC gathered the non-functional requirements well:\n     - TC talked about the trade-off between availability and consistency.\n     - TC talked about durability.\n     - TC talked about the latency.\n+ TC did the QPS estimations.\n+ TC did the API design well.\n+ TC came up with the right trade-offs between the push and pull model.\n+ TC was able to complete the overall high level design.\n+ TC came up with the high level components.\n+ TC did well in database schema design.\n\nImprovement Areas:\n- TC could have done the storage estimation and API discussion prior to high level discussion.\n- TC could have done more event-driven design.\n\nGeneral Read:\n1. CQRS architecture.\n2. Event Driven Architecture.\n\nThanks for very actionable and useful feedback. Very helpful for my upcoming interviews.",
  "transcript": "Overall:\nStrengths: + TC gathered the functional requirements well: - TC clarified if they need to provide functionality of making the friends. - TC clarified if they need to provide functionality of looking at specific user's posts. - TC clarified that they would design for the. different surfaces/devices. + TC gathered the non-functional requirements well: - TC talked about the trade-off between availability and consistency. - TC talked about durability. - TC talked about the latency. + TC did the QPS estimations. + TC did the API design well. + TC came up with the right trade-offs between the push and pull model. + TC was able to complete the overall high level design. + TC came up with the high level components. + TC did well in database schema design.\nImprovement Areas: - TC could have done the storage estimation and API discussion prior to high level discussion. - TC could have done more event-driven design.\nGeneral Read: 1. CQRS architecture. 2. Event Driven Architecture. Feedback about Red Maelstrom (the interviewer) Would you want to work with this person? How excited would you be to work with them? How good were the questions? How helpful was your interviewer in guiding you to the solution(s)? Thanks for very actionable and useful feedback. Very helpful for my upcoming interviews. Interview Transcript Microsoft Interviewer Unique ID generation Invincible Cloud, a Microsoft engineer, interviewed Golden Possum Watch interview Google Interviewer Order statistic of an unsorted array Intergalactic Avenger, a Google engineer, interviewed Supersonic Taco in Java Watch interview Google Interviewer Most frequent integer and pairs of integers sum Paisley Wallaby, a Google engineer, interviewed Propitious Bear in Java Watch interview Google Interviewer Triplet Array Rocket Wind, a Google engineer, interviewed Whirlwind Alligator in C# Watch interview See more interviews We know exactly what to do and say to get the company, title, and salary you want. Interview prep and job hunting are chaos and pain. We can help. Really. interviewing.io Data structures and algorithms interviews Company Process Guides Amazon guide Google guide Apple guide Netflix guide Microsoft guide OpenAI guide Palantir guide Anthropic guide Stripe guide Anduril guide Rippling guide All company guides Popular Interview Questions Reverse string Longest substring without repeating characters Longest common subsequence Container with most water Reverse linked list K closest points to origin Kth smallest element Reverse words in a string Interview Guides and Blog Posts Amazon Leadership Principles System Design Interview Guide FAANG Hiring Process Guide How to negotiate with Meta Guide to Meta’s AI-assisted coding interview How to sabotage your salary negotiations efforts before you even start How to get in the door at top companies For engineers For employers ©2026 Interviewing.io Inc. Made with <3 in San Francisco. Privacy Policy Terms of Service"
}